---
kind: method
id: M:Autodesk.Revit.DB.ComponentRepeater.GetEnumerator
source: html/95071080-0ca2-ca24-76a2-5fd4ec2fb209.htm
---
# Autodesk.Revit.DB.ComponentRepeater.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<ComponentRepeaterSlot> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.